import { Wrapper } from "./Wrapper"

export const AboutMe = () => {

    return <Wrapper>
        <div className="about-me">
            <h2>Обо мне</h2>
            <p>Начинал с фронтенда — JavaScript, React, TypeScript.
                Но после знакомства с книгой «Изучай Haskell во имя добра» открыл для себя иной способ думать о коде.
                Функциональное программирование стало для меня не просто инструментом, а способом мыслить чётко и красиво.
                Всё познаётся в сравнении — и Haskell показал, как можно видеть в коде структуру и смысл.</p>
            <p><i>Multi multa nemo omnia novit</i> — <strong>многие знают многое, никто не знает всё.</strong> Эта мысль напоминает мне о том, как важно понимать свои слабые стороны и продолжать учиться.</p>
            <p>Пишу статьи, где разбираю Haskell-абстракции на простых примерах.
                Если есть идея для новой темы — напишите мне
                , и, возможно, следующая статья появится на <a href="https://habr.com/ru/users/DeniLarks/articles/">Хабре.</a></p>
            <p>В обучении и исследовании идей использую ИИ — как инструмент, который помогает глубже понимать темы и находить простые объяснения сложным вещам.
                Иногда доверяю ему то, в чём чувствую неопытность, чтобы увидеть свои слабые стороны со стороны и научиться работать с ними.</p>
            <p>Не всегда силён в теории, но люблю узнавать на практике — шаг за шагом.</p>
        </div>
    </Wrapper>
}